Vijayaraj-IHT/SIH-2026/spectra-kws/firmware/sdkconfig.defaults
# Spectra KWS — ESP-IDF default configuration
# Target: XIAO ESP32-C5

# Target chip
CONFIG_IDF_TARGET="esp32c5"

# CPU frequency (max for RISC-V single core)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Wi-Fi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# Memory
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Partition table — custom to fit model in flash
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SPIRAM (if available on board)
# CONFIG_ESP_SPIRAM=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# I2S
CONFIG_I2S_ISR_IRAM_SAFE=y

# Enable PSRAM if available
# CONFIG_SPIRAM=y
# CONFIG_SPIRAM_MODE_OCT=y
